
## Plan Result (prod)




<pre><code>Plan: 1 to add, 14 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.sc_team_members_voda_data_contrib[0]
* Update
  * azurerm_key_vault_secret.appinsights-key
  * azurerm_key_vault_secret.appinsights_connection_string
  * azurerm_key_vault_secret.edit_password[0]
  * azurerm_key_vault_secret.finalsa_storage_account_connection_string
  * azurerm_key_vault_secret.finalsa_storage_account_primary_access_key
  * azurerm_key_vault_secret.ingestsa_storage_account_connection_string
  * azurerm_key_vault_secret.sa_storage_account_connection_string
  * azurerm_key_vault_secret.voda_password[0]
  * azurerm_key_vault_secret.vodasa_storage_account_connection_string
  * azurerm_key_vault_secret.vodasa_storage_account_primary_access_key
  * azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0]
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.sa_storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.appinsights-key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appinsights-key" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/AppInsightsInstrumentationKey/3f0b5b0015844ecdab6c3712482dd017"
        name                    = "AppInsightsInstrumentationKey"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.appinsights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appinsights_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/app-insights-connection-string/6bcd095bf8684e48a86eb1d701fc4e9b"
        name                    = "app-insights-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.edit_password[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "edit_password" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/videditvm1-password/76b1845bc8044195b61bde3d404bb83e"
        name                    = "videditvm1-password"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.finalsa_storage_account_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "finalsa_storage_account_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/finalsa-storage-account-connection-string/44fa9aeece1247909ba635c6e748028f"
        name                    = "finalsa-storage-account-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.finalsa_storage_account_primary_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "finalsa_storage_account_primary_access_key" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/finalsa-storage-account-primary-access-key/e890e74ecfb642a0b34b1e77962d94ea"
        name                    = "finalsa-storage-account-primary-access-key"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.ingestsa_storage_account_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "ingestsa_storage_account_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/ingestsa-storage-account-connection-string/aa257536eb78460f91d773324276f5d4"
        name                    = "ingestsa-storage-account-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sa_storage_account_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sa_storage_account_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/sa-storage-account-connection-string/54fa132345714daea67251a1f1c32d97"
        name                    = "sa-storage-account-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.voda_password[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "voda_password" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/vodavm1-password/5f44ccd3a0114e11958b18a85abde922"
        name                    = "vodavm1-password"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.vodasa_storage_account_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "vodasa_storage_account_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/vodasa-storage-account-connection-string/432370f5d99d47068e93f0e9e0e0fda4"
        name                    = "vodasa-storage-account-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.vodasa_storage_account_primary_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "vodasa_storage_account_primary_access_key" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-prod.vault.azure.net/secrets/vodasa-storage-account-primary-access-key/4550b7d2873a4fc3963b0628b5366412"
        name                    = "vodasa-storage-account-primary-access-key"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_ingest_alert_capacity" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/used_capacity"
        name                     = "used_capacity"
      ~ scopes                   = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod",
          + "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod",
        ]
        tags                     = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_role_assignment.sc_team_members_voda_data_contrib[0] will be created
  + resource "azurerm_role_assignment" "sc_team_members_voda_data_contrib" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "96a51158-459c-4ded-8360-db33af2de2f0"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prevodasaprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod"
        name                               = "prefinalsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod"
        name                               = "preingestsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/presaprod"
        name                               = "presaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.50.109.148",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 14 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1010,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->